import {
    Big,
    Char,
    Characteristics,
    Message,
    Photo,
    Title,
    Wrapper,
} from './styles.js';

export function Info() {
    return (
        <Wrapper>
            <Message>
                <Photo src="/images/avatar.png" alt="Данила Поперечный" />
                <span>
                    <Big>Привет! Я Данила Поперечный.</Big>
                    <p>
                        Я занимаюсь созданием видео и стендап комедией уже
                        больше 10 лет, но скорее всего, раз ты уже здесь - ты
                        уже знаешь, кто я. Спустя столько времени, наконец-то и
                        мы решились сделать свой полноценный сайт, на котором
                        можно приобрести мой новый стендап концерт
                        &quot;ВЕСЕЛАЯ/ЖИЗНЬ&quot; из Лондона, который снял Илья
                        Найшуллер. (спойлер - никакой стрельбы и кадров от
                        первого лица там нет, не обнадеживайтесь...)
                    </p>
                    <br />
                    <p>
                        Хочу поблагодарить вас за интерес к моим проектам и за
                        приобретение этого спешла - помимо того, что это
                        помогает мне быть независимым, это ещё и напрямую
                        отразится на качестве будущих шоу и видео, которые
                        продолжают выходить бесплатно на Ютубе (пока он ещё не
                        заблочен, естественно).
                    </p>
                    <br />
                    <p>Спасибо за внимание и приятного просмотра!</p>
                    <br />
                    <p>8 апреля 2023</p>
                </span>
            </Message>

            <Characteristics>
                <Char>
                    <Title>продолжительность</Title>
                    <span>1 час 30 минут</span>
                </Char>

                <Char>
                    <Title>дата выхода</Title>
                    <span>20 апреля 2023</span>
                </Char>

                <Char>
                    <Title>режиссер</Title>
                    <span>Илья Найшуллер</span>
                </Char>

                <Char>
                    <Title>дата съемки</Title>
                    <span>23 ноября 2022</span>
                </Char>

                <Char>
                    <Title>субтитры</Title>
                    <span>RUS / ENG</span>
                </Char>
            </Characteristics>
        </Wrapper>
    );
}
