import { TextLink } from '../../components/ui-kit/TextLink';

export const FAQ_CONTENT = [
    {
        question: 'Почему этот концерт не бесплатный?',
        answer: 'Мы много работали над этим спешлом и потратили много денег на его съемку для того, чтобы зрители могли насладиться выступлением в наилучшем качестве. Платный релиз помогает нам выходить абсолютно без цензуры, без рекламы, повышать качество будущих релизов и быть полностью независимыми. Плюс, средства идут на поддержание серверов и работоспособность сайта.',
    },
    {
        question:
            'Почему этот концерт выходит не на Ютубе, как все предыдущие?',
        answer: 'Прошлый опыт показал, что на Ютубе, как и в любой другой социальной сети, есть цензура, а теперь еще и отсутствует монетизация. Мы уже не говорим о потенциальной перспективе того, что Ютуб в ближайшее время может быть заблокирован на территории РФ. Поэтому мы приняли решение, что хотим выпустить этот концерт самостоятельно.',
    },
    {
        question: 'С каких устройств я могу посмотреть этот концерт?',
        answer: 'После приобретения вы можете смотреть концерт в браузере вашего ноутбука, планшета, смартфона, а также мы сделали возможным просмотр контента и на вашем СмартТВ. Для того, чтобы посмотреть концерт на телевизоре - нажмите на плеере соответствующую кнопку.',
    },
    {
        question:
            'Не боишься ли ты, что спешл просто спиратят и выложат в открытый доступ?',
        answer: 'Не боюсь, потому что знаю, что это неизбежно. Но, единственное, что я могу сделать - это попросить вас, мои дорогие зрители, не делать этого, так как платный релиз на нашем сайте - это не только попытка окупить затраты на съемку и сайт, но еще и дополнительный способ избежать потенциальных проблем, связанных с моими высказываниями в этом концерте. Ведь если концерт не валяется в открытую, то и увидеть его чуть сложнее.',
    },
    {
        question:
            'Но раз я купил его за деньги - значит я могу распоряжаться им как угодно, ведь так?',
        answer: 'Не совсем. Ну, точнее, совсем не так. Вы платите за возможность посмотреть этот концерт, а не покупаете права на него. ',
    },
    {
        question:
            'Что мне делать, если меня оскорбило или задело что-то в этом концерте?',
        answer: 'Оплачивая и просматривая этот концерт, вы подтвеждаете, что вам больше 18 лет и вы платежеспособный взрослый человек. Если вам настолько что-то не понравилось в концерте, что вы сознательно нашли этот пункт в FAQ и внимательно его читаете, то вот вам совет: сходите к психотерапевту и не перекладывайте ответственность за свои эмоции на долбоеба из интернета. Ну и у вас есть возможность наказать меня одним из сильнейших способов - больше никогда в жизни не награждать меня своим просмотром. ',
    },
    {
        question:
            'У меня возникли трудности с оплатой или иные проблемы на сайте.',
        answer: (
            <>
                Если вы столкнулись с какой-либо ошибкой на сайте - вы можете
                написать письмо по адресу{' '}
                <TextLink href="mailto:support@danilapoperechnyi.com">
                    support@danilapoperechnyi.com
                </TextLink>{' '}
                и наша команда свяжется с вами в ближайшее время.
            </>
        ),
    },
];
